; domain
(define (domain cooking)
    (:requirements :typing)
    (:types 
        tile countertop pot ingredient cook
    )
    (:predicates
        (at ?c - cook ?t - tile)
        (adjacent ?t1 ?t2 - tile)
        (adjacent-counter ?t - tile ?ctr - countertop)
        (ingredient-on ?i - ingredient ?ctr - countertop)
        (pot-on ?p - pot ?ctr - countertop)
        (holding ?c - cook ?i - ingredient)
        (ingredient-in-pot ?i - ingredient ?p - pot)
    )
    (:action move
    :parameters (?c - cook ?from ?to - tile)
    :precondition (and (at ?c ?from) (adjacent ?from ?to))
    :effect (and (at ?c ?to) (not (at ?c ?from))))
    (:action pickup
    :parameters (?c - cook ?i - ingredient ?ctr - countertop ?t - tile)
    :precondition (and (at ?c ?t) (ingredient-on ?i ?ctr) (adjacent-counter ?t ?ctr))
    :effect (and (holding ?c ?i) (not (ingredient-on ?i ?ctr))))  
    (:action drop-into-pot
    :parameters (?c - cook ?i - ingredient ?p - pot ?ctr - countertop ?t - tile)
    :precondition (and (holding ?c ?i) (at ?c ?t) (pot-on ?p ?ctr) (adjacent-counter ?t ?ctr))
    :effect (and (ingredient-in-pot ?i ?p) (not (holding ?c ?i))))
)

; problem
(define (problem cook-dish)
  (:domain cooking)
    (:objects
        g1 g2 g3 g4 g5 g6 g7 - tile
        ctr1 ctr2 ctr3 ctr4 ctr5 - countertop
        pot1 - pot
        ingredient1 ingredient2 ingredient3 - ingredient
        cook1 cook2 - cook
    )
    (:init
        (at cook1 g1)
        (at cook2 g6)

        (pot-on pot1 ctr1)

        (ingredient-on ingredient1 ctr3)
        (ingredient-on ingredient2 ctr4)
        (ingredient-on ingredient3 ctr5)

        (adjacent g1 g2)
        (adjacent g2 g1)
        
        (adjacent g2 g5)
        (adjacent g5 g2)
        
        (adjacent g2 g3)
        (adjacent g3 g2)
        
        (adjacent g2 g4)
        (adjacent g4 g2)
        
        (adjacent g3 g1)
        (adjacent g1 g3)
        
        (adjacent g1 g4)
        (adjacent g4 g1)
        
        (adjacent g3 g6)
        (adjacent g6 g3)
        
        (adjacent g3 g4)
        (adjacent g4 g3)
        
        (adjacent g4 g6)
        (adjacent g6 g4)
        
        (adjacent g4 g7)
        (adjacent g7 g4)
        
        (adjacent g5 g7)
        (adjacent g7 g5)
        
        (adjacent g4 g5)
        (adjacent g5 g4)
        
        (adjacent g5 g6)
        (adjacent g6 g5)
        
        (adjacent g6 g7)
        (adjacent g7 g6)
        
        (adjacent-counter g2 ctr1)
        (adjacent-counter g5 ctr1)
        (adjacent-counter g4 ctr1)
        (adjacent-counter g2 ctr2)
        (adjacent-counter g5 ctr3)
        (adjacent-counter g7 ctr3)
        (adjacent-counter g4 ctr3)
        (adjacent-counter g3 ctr4)
        (adjacent-counter g4 ctr4)
        (adjacent-counter g6 ctr4)
        (adjacent-counter g5 ctr5)
        (adjacent-counter g7 ctr5)
    )
    (:goal (and
        (at cook1 g1)
        (at cook2 g6)
        (ingredient-in-pot ingredient1 pot1)
        (ingredient-in-pot ingredient2 pot1)
        (ingredient-in-pot ingredient3 pot1)
    ))
)

; plan
1. (move cook1 g1 g4)
   deleted: (at cook1 g1)
   added: (at cook1 g4)
   goals met: 1 of 5
2. (pickup cook1 ingredient2 ctr4 g4)
   deleted: (ingredient-on ingredient2 ctr4)
   added: (holding cook1 ingredient2)
   goals met: 1 of 5
3. (drop-into-pot cook1 ingredient2 pot1 ctr1 g4)
   deleted: (holding cook1 ingredient2)
   added: (ingredient-in-pot ingredient2 pot1)
   goals met: 2 of 5
4. (pickup cook1 ingredient1 ctr3 g4)
   deleted: (ingredient-on ingredient1 ctr3)
   added: (holding cook1 ingredient1)
   goals met: 2 of 5
5. (drop-into-pot cook1 ingredient1 pot1 ctr1 g4)
   deleted: (holding cook1 ingredient1)
   added: (ingredient-in-pot ingredient1 pot1)
   goals met: 3 of 5
6. (move cook1 g4 g5)
   deleted: (at cook1 g4)
   added: (at cook1 g5)
   goals met: 3 of 5
7. (pickup cook1 ingredient3 ctr5 g5)
   deleted: (ingredient-on ingredient3 ctr5)
   added: (holding cook1 ingredient3)
   goals met: 3 of 5
8. (drop-into-pot cook1 ingredient3 pot1 ctr1 g5)
   deleted: (holding cook1 ingredient3)
   added: (ingredient-in-pot ingredient3 pot1)
   goals met: 4 of 5
9. (move cook1 g5 g2)
   deleted: (at cook1 g5)
   added: (at cook1 g2)
   goals met: 4 of 5
10. (move cook1 g2 g1)
   deleted: (at cook1 g2)
   added: (at cook1 g1)
   goals met: 5 of 5
